<template>
    <div v-show="showComponent">
      <h1>О предприятии</h1>
      <div class="block-about">
        <div class="block-about2">
          <p>
            Мы занимаемся арендой надувных лодок, а также предоставляем возможность 
            забронировать прекрасный номер в нашей гостинице.
            Сотрудники компании работают ежедневно и готовы оперативно забронировать 
            оборудование или номер для вас по телефону. Сдаем лодки на срок от четырех часов. 
            Аренда лодки с избавит от необходимости больших трат, решения вопросов 
            хранения и технического обслуживания.
            А проживание в нашей гостинице не заставит переживать о том, где 
            остановить на ночь самостоятельно или с компанией.
          </p>
          <img class="img-about" src="../../assets/1.jpg">
          <p>
          Позвоните и узнайте подробности аренды лодок и бронирования номера в нашей
          гостинице.
        </p>
        </div>
        <div class="block-about2">
          <img class="img-about" src="../../assets/0.jpg">
          <p>
            Лодочный парк включает модели пассажировместимостью от 2 до 5 человек. 
            Все оборудование проходит регулярное техническое обслуживание. 
            Обязательно производится замена деталей по мере износа, своевременно 
            устанавливаются новые расходные материалы, на лодках проверяется целостность 
            каркаса. Мы храним лодки с соблюдением правил, предусмотренных для ПВХ изделий.  
          </p>    
          <p>
            Сотрудники компании готовы проконсультировать по вопросам аренды круглосуточно. 
            Если вы не уверены в том, какое именно оборудование подойдет для отдыха, 
            посоветуйтесь с нашим специалистом. Он подберет нужный комплект исходя из
            вашего опыта и условий эксплуатации. 
          </p>
        </div>
      </div>
    </div>
</template>

<script>
export default {
  name: 'aboutPage',
  computed: {
    showComponent () {
        return this.$store.getters.getCurrentMenuItem === "aboutPage"
    }
  }
}
</script>

<style scoped>
.block-about {
  width: 100%;
    height: 100%;
    display: flex;
    text-align: center;
    justify-content: center;
    align-items: center;
}

.block-about2 {
  width: 60vh;
  height: auto;
  margin: 5vh;
  text-align: left;
  font-size: 24px;
}

.img-about {
  width: 600px;
}
</style>